INSERT INTO user_table
VALUES
('root','e10adc3949ba59abbe56e057f20f883e');

INSERT INTO Owner_Info
VALUES
('张三','男','13111111111','100100199001011211',NULL),
('李四','男','0580-1111111','100100199001011311',NULL),
('王五','女','13111111112','100100199001011212',NULL);

INSERT INTO House_Info
VALUES
('1#1-101',1,1,1,101,100,'已销售','三室一厅',NULL,1),
('2#2-201',2,2,2,201,80,'未销售','三室一厅',NULL,NULL),
('2#2-202',2,2,2,202,81,'已销售','三室一厅',NULL,2),
('3#1-402',3,1,4,402,96,'待入住','三室一厅',NULL,3);

INSERT INTO Parking_Info
VALUES
('A-1','A','已出租','粤S00001',NULL,1),
('B-13','B','未销售',NULL,NULL,NULL),
('C-2','C','已销售','粤S00002',NULL,2);

INSERT INTO Repair_Info
VALUES
('2018-8-10','楼梯灯泡不亮','2幢1单元4楼灯泡坏，无法点亮','未维修',NULL,NULL,1),
('2018-8-11','水管爆裂','2幢1单元1楼水管爆裂','未维修',NULL,NULL,2),
('2018-8-11','水管爆裂2','2幢1单元1楼水管爆裂','未维修',NULL,NULL,3);

INSERT INTO Complaint_Info
VALUES
('2018-8-21','楼道打扫不干净','2幢1单元楼道打扫不干净','已处理','已派人重新打扫','2018-8-22',1),
('2018-8-22','楼道打扫不干净2','2幢2单元楼道打扫不干净','未处理',NULL,NULL,2),
('2018-8-23','楼道打扫不干净3','2幢3单元楼道打扫不干净','未处理',NULL,NULL,3);